views/site/masters.php

SELECT * FROM `regions` WHERE `id`='34'
---
                    </ul>
                    <p>
                        <button type="button" class="btn btn-md btn-primary">Предложить заказ</button>
                        <span class="btn btn-md pull-right">г.<?= \app\models\Regions::findOne($item['city'])['name'] ?></span>