models/Technics.php

SELECT * FROM `technics`
---
    public function getTechnics($tech = 'none') {
        $technics = $this->find()->asArray()->all();